; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_7_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 - counter
	)
  (:init
		(= (value c0) 15)
	(= (value c1) 14)
	(= (value c2) 0)
	(= (value c3) 62)
	(= (value c4) 76)
	(= (value c5) 56)
	(= (value c6) 74)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
		)
	)
)

; plan
1. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 3 of 6
2. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 3 of 6
3. (increase_rate c5)
   changed: (rate_value c5) from 2 to 3
   goals met: 3 of 6
4. (increase_rate c5)
   changed: (rate_value c5) from 3 to 4
   goals met: 3 of 6
5. (increase_rate c5)
   changed: (rate_value c5) from 4 to 5
   goals met: 3 of 6
6. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 3 of 6
7. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 3 of 6
8. (increment c5)
   changed: (value c5) from 56 to 61
   goals met: 3 of 6
9. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 3 of 6
10. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 3 of 6
11. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 3 of 6
12. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 3 of 6
13. (increment c1)
   changed: (value c1) from 14 to 16
   goals met: 4 of 6
14. (increment c5)
   changed: (value c5) from 61 to 66
   goals met: 4 of 6
15. (increment c5)
   changed: (value c5) from 66 to 71
   goals met: 4 of 6
16. (increment c5)
   changed: (value c5) from 71 to 76
   goals met: 3 of 6
17. (decrement c4)
   changed: (value c4) from 76 to 74
   goals met: 4 of 6
18. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 4 of 6
19. (increase_rate c2)
   changed: (rate_value c2) from 3 to 4
   goals met: 4 of 6
20. (increment c2)
   changed: (value c2) from 0 to 4
   goals met: 4 of 6
21. (increment c2)
   changed: (value c2) from 4 to 8
   goals met: 4 of 6
22. (increment c2)
   changed: (value c2) from 8 to 12
   goals met: 4 of 6
23. (increment c2)
   changed: (value c2) from 12 to 16
   goals met: 4 of 6
24. (increment c2)
   changed: (value c2) from 16 to 20
   goals met: 5 of 6
25. (decrement c5)
   changed: (value c5) from 76 to 71
   goals met: 5 of 6
26. (decrement c4)
   changed: (value c4) from 74 to 72
   goals met: 5 of 6
27. (decrement c4)
   changed: (value c4) from 72 to 70
   goals met: 6 of 6
